Repository: kuma35/sed47doc-jp
Catalog: sed47doc-jp-level2.tmx
Source language: en_us
Languages: ja

source: In particular, lines will be selected when there exists a non-negative n such that the current line-number equals first + (n * step).
ja: 数値 n がいずれかの正の数であるとして、 現在行が式 first + (n * step) に合致する場合に選択されます。

source: In sandbox mode, e/w/r commands are rejected - programs containing them will be aborted without being run.
ja: サンドボックスモードでは 'e'、'w'、'r'コマンドは弾かれます。それらを含むプログラムは実行されずにアボートします。

source: In the examples below the label is ‘x’.
ja: ラベルの例として以下の‘x’をご覧ください。

source: In the first example, the n commands first prints the content of the pattern space, empties the pattern space then reads the next input line.
ja: 最初の例ではnコマンドは最初にパターンスペースの内容をプリントし、それからパターンスペースの内容を全削除し、それから次の入力行を読み込みます。

source: In the following example, sed tries to read a file named ‘hello.txt ; N’.
ja: 次の例ではsedはファイル名‘hello.txt’のファイルを読み込もうとしています。.

source: In the following examples, the \xCE\xCE is an invalid multibyte sequence, while \xCE\A3 is a valid multibyte sequence (of the Greek Sigma character).
ja: 以下の例では\xCE\xCEは不正なマルチバイト文字を含む文字列ですが、 \xCE\A3は適正なマルチバイト文字（ギリシャ文字のシグマ）を含む文字列です。

source: In the second example, the N commands appends the next input line to the pattern space (with a newline).
ja: ２番目の例では、Nコマンドはひたすら次の行を（改行付きで）パターンスペースに追加していきます。

source: In this case, if the file that is specified on the command line is a symbolic link, sed will follow the link and edit the ultimate destination of the link.
ja: この場合、コマンドラインで指定したファイルがシンボリックリンクだったら、sedはリンクを辿り、リンク最終先(大元)のファイルを編集します。

source: Increment a Number
ja: 数字のインクリメント

source: Index
ja: 索引

source: Instead, some commands can be used as conditionals or to change the default flow control:
ja: 代わりにいくつかのコマンドは、条件文や、制御の流れを変えるために使えます。

source: Introduction
ja: はじめに

source: Invalid command, invalid syntax, invalid regular expression or a GNU sed extension command used with --posix.
ja: 不正なコマンドまたは不正な構文または不正な正規表現または、--posixコマンドラインオプションが指定されているのにGNU sed拡張が使われている。

source: Invalid multibyte characters
ja: 不正なマルチバイト文字

source: Invocation
ja: 起動

source: It is distributed together with sed.
ja: それはsedと一緒に配布されました。

source: It is usually the same as ‘s/.*//’, but is more efficient and works in the presence of invalid multibyte sequences in the input stream.
ja: これは‘s/.*//’と同様ですが、より有能で、入力ストリームに不正なマルチバイト文字が現れる時も動作します。

source: Joining lines
ja: 行連結

source: Labels are defined with a colon followed by one or more letters (e.g. ‘:x’).
ja: ラベルはコロン(:)に続く1文字またはそれ以上の文字列です（例えば‘:x’）。

source: Labels used in b,t,T,: commands are read until a semicolon.
ja: ラベルを使うコマンドである'b'、't'、'T'、':' は当該のコマンド直後からセミコロンや改行までを読み取ります。

source: Leading and trailing whitespace is ignored.
ja: 先頭の空白文字と末尾の空白文字があっても無視されます。

source: Less Frequently-Used Commands
ja: あまり使われないコマンド群

source: Less frequently used commands
ja: あんまり使われないコマンド達

source: Like q, it provides the ability to return an exit code to the caller.
ja: qコマンドと同様にsed呼び出し元へexit codeを返す事ができます。

source: Limitations and (non-)limitations of GNU sed
ja: GNU sedの制限と、GNU sedで撤廃された制限

source: Line length adjustment
ja: 行の長さを揃える

source: Lines are accumulated in the pattern space until there are no more input lines to read, then the N command terminates the sed program.
ja: 入力ストリームからこれ以上入力行が読み込めなくなるまで入力行をパターンスペースに蓄積します。そしてNコマンドはsedを終了させます。

source: Make Duplicate Lines Unique
ja: 同一行を1つにまとめる

source: Multibyte characters and Locale Considerations
ja: マルチバイト文字とロケールに関する考慮事項

source: Multibyte regexp character classes
ja: マルチバイト正規表現キャラクタクラス

source: Multiline techniques - using D,G,H,N,P to process multiple lines
ja: 複数行テクニック - D,G,H,N,P コマンドで複数行処理

source: Multiple commands syntax
ja: 複数コマンド構文

source: Multiple lines can be processed as one buffer using the D,G,H,N,P.
ja: 複数行は D,G,H,N,P コマンドを使って1つのバッファで処理できます。

source: Multiple scripts can be specified with -e or -f options.
ja: '-e'や'-f'コマンドラインオプションで複数のスクリプトを指定することができます。

source: Next: Command and Option Index, Previous: GNU Free Documentation License, Up: Top [Contents][Index]
ja: Next: sedコマンドとコマンドラインオプションの索引, Previous: GNU Free Documentation License, Up: Top [Contents][Index]

source: Next: Command-Line Options, Up: Invoking sed [Contents][Index]
ja: 次: コマンドラインオプション, 上: sedの起動 [目次][索引]

source: Next: Exit status, Previous: Overview, Up: Invoking sed [Contents][Index]
ja: 次: 終了ステータス, 前: 概要, 上: sedの起動 [目次][索引]

source: Next: Hold and Pattern Buffers, Up: advanced sed [Contents][Index]
ja: 次: Hold and Pattern Buffers, Up: advanced sed [Contents][Index]

source: Next: Introduction, Up: (dir) [Contents][Index]
ja: 次: はじめに, 上: (dir) [目次][索引]

source: Next: Invoking sed, Previous: Top, Up: Top [Contents][Index]
ja: 次: sedの起動, 前: Top, 上: Top [目次][索引]

source: Next: Numeric Addresses, Up: sed addresses [Contents][Index]
ja: 次: 数値指定アドレス, 上: sed アドレス [Contents][索引]

source: Next: The "s" Command, Previous: sed script overview, Up: sed scripts [Contents][Index]
ja: 次: "s"コマンド, 前: sedスクリプト概要, 上: sedスクリプト [目次][索引]

source: Next: sed addresses, Previous: Invoking sed, Up: Top [Contents][Index]
ja: 次: sedアドレス, 前: sedの起動, 上: Top [目次][索引]

source: Next: sed commands list, Up: sed scripts [Contents][Index]
ja: 次: sedコマンド一覧, 上: sedスクリプト [目次][索引]

source: Next: sed regular expressions, Previous: sed scripts, Up: Top [Contents][Index]
ja: 次: sed正規表現, 前: sedスクリプト, 上: Top [Contents][索引]

source: Next: sed scripts, Previous: Introduction, Up: Top [Contents][Index]
ja: 次: sedスクリプト, 前: はじめに, 上: Top [目次][索引]

source: Normally sed is invoked like this:
ja: 通常sedは次のように起動します。

source: Note that sed silently ignores read/write errors in r,R,w,W commands (such as missing files).
ja: r、R、w、Wコマンドは（指定したファイルが存在しない等の）ファイル入出力エラーを単純に無視します。ご注意下さい。

source: Note that if filename cannot be read, or if its end is reached, no line is appended, without any error indication.
ja: 注意：filenameで指定したファイルから読み込みできなかったり、既にEOFに到達していたら何もしない。なおその時何のエラーも出しません。

source: Note that specifying the text to add (‘Hello’) immediately after a,c,i is itself a GNU sed extension.
ja: a、c、i コマンド直後に直接テキスト(‘Hello’)を追加できる自体がGNU sed拡張であることに注意して下さい。

source: Note that, unlike the r command, the output of the command will be printed immediately; the r command instead delays the output to the end of the current cycle.
ja: rと異なり、シェルコマンドの実行結果を即座にプリントします。 代わりに、rコマンドはサイクルの終わりまで出力を遅延します。

source: Note the difference between branching to a label and restarting the cycle: when a cycle is restarted, sed first prints the current content of the pattern space, then reads the next input line into the pattern space; Jumping to a label (even if it is at the beginning of the program) does not print the pattern space and does not read the next input line.
ja: ブランチコマンドによるジャンプと次のサイクルの開始との違いに注意して下さい。次のサイクルの開始時はsedはまずパターンスペースの内容をプリントして次に入力ストリームから1行パターンスペースに読み込みます。一方ラベルへのジャンプは（それがたとえプログラムの先頭へジャンプしたとしても）、パターンスペースの内容はプリントされませんし入力ストリームから次の1行を読み込む事もありません。

source: Numbering Lines
ja: 行番号を付ける

source: Numbering Non-blank Lines
ja: 空行以外の行に行番号を付ける

source: Often used commands
ja: よく使われるコマンド達

source: Often-Used Commands
ja: よく使われるコマンド群

source: On all lines except the last, the pattern space is deleted and the cycle is restarted.
ja: $!によって最終行以外ではパターンスペースの内容の全削除と残りの処理をスキップして次のサイクルを開始します。

source: On each cycle, the pattern space is printed and the next input line is read:
ja: よってどのサイクルでもパターンスペースの内容がプリントされて入力ストリームから次の入力行を読み取ります。

source: On the command line, all sed commands may be separated by newlines.
ja: コマンドラインでも、全てのsedコマンドは改行で区切る事ができます。

source: On the last line ($), the hold space is retrieved (x), newlines are removed (s/\n//g), and any remaining octets are printed unambiguously (l).
ja: 最終行($)では, the hold space is retrieved (x), newlines are removed (s/\n//g), and any remaining octets are printed unambiguously (l).

source: One or more of the input file specified on the command line could not be opened (e.g. if a file is not found, or read permission is denied).
ja: コマンドラインで指定した1つまたはそれ以上ファイルがオープンできなかった(例えばファイルが存在しなかった、また読み取り許可権限が無かった)。

source: Options -e and -f can be combined, and can appear multiple times (in which case the final effective script will be concatenation of all the individual scripts).
ja: '-e'や'-f'コマンドラインオプションは混在かつ複数回記述することができ、実行されるスクリプトはそれぞれのスクリプトをそのコマンドラインオプションの順番どおりに連結したものになります。

source: Other resources for learning about sed
ja: sedを学ぶための資料

source: Overview
ja: 概要

source: Overview of basic regular expression syntax
ja: 基本正規表現文法概要

source: Overview of extended regular expression syntax
ja: 拡張正規表現文法概要

source: Overview of regular expression in sed
ja: sedの正規表現の概要

source: Previous: Command-Line Options, Up: Invoking sed [Contents][Index]
ja: 前: コマンドラインオプション, 上: sedの起動 [目次][索引]

source: Print bash Environment
ja: bashの環境変数をプリント

source: Print Duplicated Lines of Input
ja: 重複した行のみプリントする。

source: Print a usage message briefly summarizing these command-line options and the bug-reporting address, then exit.
ja: これらコマンドラインオプション達の短く要約した使い方とバグ報告先をプリント次第終了します。

source: Print out the file name of the current input file (with a trailing newline).
ja: 現在の入力ファイル名を（末尾に改行を伴って）出力します（標準入力の場合は'-'）。

source: Print out the version of sed that is being run and a copyright notice, then exit.
ja: 起動したsed自身のバージョンと著作権表示をプリント次第終了します。

source: Print the input sed program in canonical form, and annotate program execution.
ja: 入力されたプログラムを標準形式でプリントし、注釈付きで実行します。

source: Print the pattern space in an unambiguous form.
ja: パターンスペースの内容を非表示文字も目に見えるようにプリントする。

source: Print the pattern space, up to the first <newline>.
ja: パターンスペースの最初の改行(改行含む)までの1行をプリントする。

source: Print the pattern space.
ja: パターンスペースの内容をプリントする。

source: Printing the First Lines
ja: 最初の数行をプリントする

source: Printing the Last Lines
ja: 末尾の数行をプリントする

source: Processing continued with other files.
ja: 但し、オープンできた他のファイルに付いては処理が続行されます。

source: Queue a line of filename to be read and inserted into the output stream at the end of the current cycle, or when the next input line is read.
ja: filenameで指定したファイルからたかだか1行読み込み現在のサイクルの最後で出力ストリームに挿入する。 それから次の入力行が読み込まれる。

source: Range Addresses
ja: 範囲アドレス

source: Regular expressions: selecting text
ja: 正規表現：テキストを選択する。

source: Remove All Duplicated Lines
ja: 重複行を全て取り除く（重複してない行のみプリントする）

source: Rename Files to Lower Case
ja: ファイル名を小文字にする

source: Replace (change) lines with text (alternative syntax).
ja: (change)行を text で置き換える(代替文法)。

source: Replace (change) lines with text.
ja: (change)行をtext で置き換える。

source: Replace the contents of the pattern space with the contents of the hold space.
ja: パターンスペースの内容をホールドスペースの内容で置き換えます(cp hold-space pattern-space)。

source: Reporting Bugs
ja: 報告済のバグ

source: Reporting bugs
ja: 報告済のバグ

source: Reverse Characters of Lines
ja: 行の文字を逆順にする

source: Reverse Lines of Files
ja: ファイルの行の順番を逆順にする

source: Same as -E -i with no backup suffix - FILE will be edited in-place without creating a backup.
ja: これは -E -i と同じです。拡張子の指定が無いのでバックアップファイルは作成されず、FILEが直接書き換えられます。

source: Sandbox mode ensures sed operates only on the input files designated on the command line, and cannot run external programs.
ja: サンドボックスモードでは、 sed はコマンドラインで指定された入力ファイルに対してのみ機能し、外部プログラムを実行することはできません。

source: See Execution Cycle and Addresses overview.
ja: 実行サイクルとアドレス概要も参照下さい。

source: See Multiple commands syntax.
ja: 複数コマンド構文も参照下さい。

source: See Extended regular expressions.
ja: 拡張正規表現も参照下さい。

source: See Overview.
ja: 概要もご覧ください。

source: See also the W and s///w commands for writing output to other files.
ja: そして、'W'コマンドや's///w'コマンド(wフラグ付き)は指定の他のファイルに書き出します。

source: Selecting lines by numbers
ja: 数による行の選択

source: Separate the commands using -e or a newline:
ja: これらのコマンドは-eオプションや改行で区切る必要があります。

source: Similarly, the ’catch-all’ regular expression ‘.*’ does not match the entire line:
ja: 同様に、’全てをキャッチする’ 正規表現 ‘.*’ を使ってみても行全体ともマッチできません。

source: Some are standard POSIX commands, while other are GNU extensions.
ja: POSIX標準コマンドもあれば、GNU拡張もあります。

source: Some implementations have a limit of 199 commands per script
ja: いくつかのsed実装では1スクリプト辺りのコマンド数は199までという制限があります。

source: Some sample scripts
ja: サンプルスクリプト達

source: Specify the default line-wrap length for the l command.
ja: 'l' sedコマンドで行を折り返すデフォルトの長さを指定します。

source: Specifying a line number will match only that line in the input.
ja: 行番号を指定すると入力の当該行番号の行だけにマッチします

source: Squeezing Blank Lines
ja: 連続する空白行を1行の空白行にする

source: Successful completion.
ja: 完璧に成功。

source: Table of Contents
ja: 目次

source: Table of contents
ja: 目次

source: Text search across multiple lines
ja: 複数行にわたるテキスト検索

source: That is, if the ! character follows an address or an address range, then only lines which do not match the addresses will be selected.
ja: すなわち、!文字がアドレスやアドレス範囲の後ろにあると、選択したアドレス以外の行を対象とします。

source: The D command then removes the content of pattern space up to the first newline (leaving ‘2’ at the end of the first cycle).
ja: Dコマンドはパターンスペースの内容を最初の改行まで(その改行含む)削除し、そしてDパターンスペースの削除をスキップして次のサイクルを開始します （よって、次のサイクルは(2行目の)2’だけ状態から始まる）。

source: The b command (the only command in the program) does not have a label, and thus simply restarts the cycle.
ja: （このプログラム唯一のコマンドである）bコマンドは飛び先ラベルが書かれていないので次のサイクルを開始します。

source: The b command jumps to the ‘x’ label, and a new cycle is never started:
ja: bコマンドは‘x’ラベルにジャンプし、そして永遠に最初のサイクルにとどまり決して新しいサイクルが始まることはありません。

source: The b,t and T commands can be followed by a label (typically a single letter).
ja: bコマンドやtコマンドやTコマンドは、コマンドに続くジャンプ先ラベルが必要です（通常はアルファベット1文字）。

source: The l command prints the content of the pattern space unambiguously.
ja: lコマンドはパターンスペースの内容を非表示文字等含めて目に見える形でプリントします(削除はしない)。

source: The r,R,w,W commands parse the filename until end of the line.
ja: r、R、w、Wコマンドはその行末までをファイル名として解釈します。

source: The s Command
ja: s コマンド

source: The {,},b,t,T,: commands can be separated with a semicolon (this is a non-portable GNU sed extension).
ja: {、}、b、t、T、:コマンドがセミコロンで区切れるのはGNU sed拡張です。

source: The x command fetches the accumulated lines from the hold space back to the pattern space.
ja: xコマンドはパターンスペースの内容をホールドスペースの内容（累積した行）で置き換えます。

source: The s/// command then operates on all the text in the paragraph (including the embedded newlines).
ja: s///は（改行を含んだ）段落内の全てのテキストに対して実行されます 。

source: The y/// command is still executed on all lines:
ja: いずれにせよy///コマンドは全ての行で実行されます。

source: The label may be omitted, in which case the next cycle is started.
ja: ラベルを省略したときは次のサイクルを開始します。

source: The branching commands b, t, and T enable changing the flow of sed programs.
ja: 分岐コマンドのbやtやTはsedプログラムの流れを変える事を可能にします。

source: The command can run across multiple lines, all but the last ending with a back-slash.
ja: コマンドは複数行に渡って書くことができ、コマンドの最後以外の各行の末尾にはバックスラッシュ'\'を書きます。

source: The default behavior is to break the symbolic link, so that the link destination will not be modified.
ja: デフォルトの動作はシンボリックリンクを解除することで、リンク先は変更されません。

source: The default is 4.0 because that is the first version that implemented this command.
ja: デフォルトのバージョンは 4.0 です。なぜならこのコマンドが最初に実装されたバージョンが4.0だからです。

source: The extension, if supplied, is used to modify the name of the old file before renaming the temporary file, thereby making a backup copy2).
ja: もしこのコマンドラインオプションのパラメータとして拡張子が与えられていれば、テンポラリファイルを入力ファイル名にリネームする前に、入力ファイル名を変更します。これによりバックアップコピー2)が作成されます。

source: The file is missing, and the error is silently ignored:
ja: しかしファイルがありませんでした。でもエラーも一切出さずに無視され次のコマンドの実行に移ります。

source: The first (contrived) example uses the b command to skip the s/// command on lines containing ‘1’.
ja: 最初の（わざとらしい）例は‘1’を含む行の時にs///をスキップするためにbコマンドを使っています。

source: The first example works with GNU sed.
ja: 最初の例はGNU sed用です。

source: The first expression, /./{H;$!d} operates on all non-empty lines, and adds the current line (in the pattern space) to the hold space.
ja: スクリプト1行目の/./{H;$!d}は空行以外の全ての行に対して実行され、（パターンスペース内の) 現在行をホールドスペースに追加します。

source: The following sed program removes all valid characters using s/.//g.
ja: sedプログラムはs/.//gによって全ての適正な文字を取り除きます。

source: The following command modifies file.txt and does not produce any output:
ja: 次のコマンドはfile.txtを書き換え、そして一切(標準出力に)出力しません。

source: The following command prints only line 45 of the input file:
ja: 次のコマンドは入力の45行目だけをプリントします。

source: The following command replaces the word ‘hello’ with ‘world’ on all lines in the input file:
ja: 次のコマンドは、入力ファイルから読み込んだ全ての行で‘hello’を‘world’に置き換えます。

source: The following command replaces the word ‘hello’ with ‘world’ only in lines 1 to 3 and 18 till the last line of the input file (i.e. excluding lines 4 to 17):
ja: 次のコマンドは入力ファイルの1から3行と18から最終行だけ‘hello’を‘world’に置き換えます（すなわち excluding lines 4 to 17）。

source: The following command replaces the word ‘hello’ with ‘world’ only in lines containing the word ‘apple’:
ja: 次のコマンドは、 ‘apple’を含む行でだけ‘hello’を‘world’に置き換えます。

source: The following command replaces the word ‘hello’ with ‘world’ only in lines 4 to 17 (inclusive):
ja: 次のコマンドは、4行から17行だけ‘hello’を‘world’に置き換えます(inclusive)。

source: The following command replaces the word ‘hello’ with ‘world’ only on line 144:
ja: 次のコマンドは、144行でだけ‘hello’を‘world’に置き換えます。

source: The following command replaces the word ‘hello’ with ‘world’ only in lines not containing the word ‘apple’:
ja: 次のコマンドは‘apple'を含まない行だけ‘hello’を‘world’に置き換えます。

source: The following commands are equivalent:
ja: 次の3つは等価です。

source: The following commands are supported in GNU sed.
ja: 以下のコマンド群はGNU sedでサポートされています。

source: The following commands cannot be separated by a semicolon and require a newline:
ja: 次のコマンドはセミコロンで区切ることができなくて改行で区切る事が必要です。:

source: The following example deletes lines 30 to 35 in the input.
ja: 次の例は入力の30行目から35行目を削除します。

source: The following example demonstrates this technique:
ja: 以下の例はこのテクニックのデモです。

source: The following example illustrates the operation of N and D commands:
ja: 次の例は、NコマンドやDコマンドの動作を示しています。

source: The following example is an infinite-loop - it doesn’t terminate and doesn’t print anything.
ja: 次のサンプルは無限ループに陥ります。一切プリントすることなく終了もしません（訳注：CTRL+C等で強制停止させる）。

source: The following example prints all input until a line starting with the word ‘foo’ is found.
ja: 次の例は行頭に‘foo’がある行を全てプリントします。

source: The following example prints the first line of the first file (one.txt) and the last line of the last file (three.txt).
ja: 次の例は最初のファイル(one.txt)の最初の行をプリントし、そして最後のファイル(three.txt)の最後の行をプリントします。

source: The following example uses the Greek letter Capital Sigma (Σ, Unicode code point 0x03A3).
ja: 次の例ではギリシャ文字の大文字のシグマ (Σ, ユニコードでは 0x03A3)を使用しています。

source: The following examples are all equivalent.
ja: 以下の例は全て等価です。

source: The following examples are equivalent:
ja: 以下の3つは等価です。

source: The following program is a no-op.
ja: 以下のプログラム自身は何もしません。

source: The following two sed programs are equivalent.
ja: 以下の2つのsedプログラムは等価です。

source: The full format for invoking sed is:
ja: sedを起動する完全な書式は次の通りです。

source: The hold space, on the other hand, keeps its data between cycles (see commands ‘h’, ‘H’, ‘x’, ‘g’, ‘G’ to move data between both buffers).
ja: 一方ホールドスペースの内容はサイクル毎に削除しません。以降の新しいサイクルが始まっても内容を保持しています（両バッファの間でデータを移動させるためのコマンド、 ‘h’, ‘H’, ‘x’, ‘g’, ‘G’ も参照下さい）。

source: The other expressions x and s are executed only on empty lines (i.e. paragraph separators).
ja: 残りのスクリプトx と s は空行（すなわち段落の区切り）に対してだけ実行されます。

source: The regular expression ‘.’ does not match it:
ja: 正規表現.はこれにマッチできません。

source: The second example uses an address with negation (‘!’) to perform substitution only on desired lines.
ja: 2番目の例ではアドレスの否定（ '！'）を使用して、目的の行のみs///コマンドを実行します。

source: The second is a portable equivalent.
ja: 次の例は移植性のある(GNU sedでなくても動く)同等例です

source: The standard input will be processed if no file names are specified.
ja: ファイル名が与えられなかった場合も標準入力として処理されます。

source: Then commands are executed; each command can have an address associated to it: addresses are a kind of condition code, and a command is only executed if the condition is verified before the command is to be executed.
ja: 次にコマンド群を実行します。各コマンドはそのコマンドに関連付けられたアドレスを持つこともできます。アドレスは一種の条件コードで、条件に合致した時だけそのコマンドが実行されます。

source: There are several methods to specify multiple commands in a sed program.
ja: sedプログラムでは複数のコマンドを与える時にいくつかの書き方があります。

source: These commands are specific to GNU sed, so you must use them with care and only when you are sure that hindering portability is not evil.
ja: これらのコマンドはGNU sed固有なので、作成するsedプログラムが移植性に留意する必要がない場合のみ使うようにして下さい。

source: These options disable this automatic printing, and sed only produces output when explicitly told to via the p command.
ja: これらのコマンドラインオプションは各サイクル終了時の自動プリントを無効にし、その際sedは'p'コマンドで明示的に指示された場合のみプリントします。

source: They allow you to check for GNU sed extensions or to do tasks that are required quite often, yet are unsupported by standard seds.
ja: 以下はGNU sed拡張を確認や日常の作業をするのに役立ちます。でも、まだ標準のsedではサポートされていません。

source: They are similar to their lowercase counterparts (d,g, h,n,p), except that these commands append or subtract data while respecting embedded newlines - allowing adding and removing lines from the pattern and hold spaces.
ja: これらに対応する小文字の（d,g, h,n,p）は), except that these commands append or subtract data while respecting embedded newlines - allowing adding and removing lines from the pattern and hold spaces.

source: They operate as follows:
ja: これらのコマンドの動作は以下の通り。

source: They perform two sed operations: deleting any lines matching the regular expression /^foo/, and replacing all occurrences of the string ‘hello’ with ‘world’:
ja: 以下の例はふたつのsed操作を実行します。正規表現 /^foo/ にマッチする行を削除します。そして‘hello’が現れると全て‘world’に置換します。

source: This GNU sed extension allows the user to consider them as separate files: range addresses (such as ‘/abc/,/def/’) are not allowed to span several files, line numbers are relative to the start of each file, $ refers to the last line of each file, and files invoked from the R commands are rewound at the start of each file.
ja: このGNU sed拡張はファイルをそれぞれに分けて処理することを可能にします。範囲アドレス(‘/abc/,/def/’のような)が複数のファイルに渡らないようにしたり、行番号をファイルごとにリセットしたり、'$'が各ファイルの最終行にマッチするようにしたり、'R'コマンドで読み込むファイルからの読み込み位置をファイルごとに巻き戻したり。

source: This GNU extension matches every stepth line starting with line first.
ja: このGNU拡張は、firstと、firstから指定stepごとの行にマッチします。

source: This address matches the last line of the last file of input, or the last line of each file when the -i or -s options are specified.
ja: このアドレス指定は入力ファイル群の最後のファイルの最終行、または、-i or -sコマンドラインオプションが指定された時は入力の各ファイルごとの最終行にマッチします。

source: This allows you to add a prefix to the backup file, instead of (or in addition to) a suffix, or even to place backup copies of the original files into another directory (provided the directory already exists).
ja: これにより、接尾辞(サフィックス)の代わりに（またはそれに加えて）バックアップファイルに接頭辞(プレフィックス)を追加したり、元のファイルのバックアップコピーを別のディレクトリに配置することができます（ディレクトリが既に存在する場合）。

source: This chapter covers how to run sed.
ja: この章ではsedの実行方法について説明します。

source: This command accepts only one address.
ja: このコマンドは単一のアドレスのみ受け入れます（アドレス範囲不可）。

source: This command allows one to pipe input from a shell command into pattern space.
ja: このコマンドはシェルコマンドからの入力をパターンスペースにパイプラインできます。

source: This command can be useful because the only alternative ways to accomplish this apparently trivial function are to use the -n option (which can unnecessarily complicate your script) or resorting to the following snippet, which wastes time by reading the whole file without any visible effect:
ja: このコマンドの代替方法は-nコマンドラインオプションの使用（スクリプトを必要以上に複雑にする）または次のコード片(スニペット)に頼る(何も表示されないけどファイル末尾まで行を読み込むので時間を無駄にする)ことです。

source: This command does nothing, but makes sed fail if GNU sed extensions are not supported, simply because other versions of sed do not implement it.
ja: このコマンドはGNU sedでは何もしません（が、コマンドとして有効)。しかしGNU sed 拡張がサポートされていないと失敗します。なぜなら他のsedではこのコマンドは実装されてないからです。

source: This command empties the content of pattern space.
ja: このコマンドはパターンスペースの内容を全削除します。

source: This command enables all GNU extensions even if POSIXLY_CORRECT is set in the environment.
ja: POSIXLY_CORRECT 環境変数が設定されていても、このコマンドはGNU拡張の利用を許可します。

source: This command is the same as q, but will not print the contents of pattern space.
ja: このコマンドはqコマンドと同じですが、パターンスペースの内容をプリントしません。
